In [ ]:
!apt-get install openjdk-8-jdk-headless -qq > /dev/null
!wget -q http://archive.apache.org/dist/spark/spark-3.1.1/spark-3.1.1-bin-hadoop3.2.tgz
!tar xf spark-3.1.1-bin-hadoop3.2.tgz
!pip install -q findspark

In [ ]:
import os
os.environ["JAVA_HOME"] = "/usr/lib/jvm/java-8-openjdk-amd64"
os.environ["SPARK_HOME"] = "/content/spark-3.1.1-bin-hadoop3.2"

In [ ]:
!ls

custs1.txt   spark-3.1.1-bin-hadoop3.2
sample_data  spark-3.1.1-bin-hadoop3.2.tgz

In [ ]:
import findspark
findspark.init()
from pyspark.sql import SparkSession
spark = SparkSession.builder.master("local[*]").getOrCreate()
spark.conf.set("spark.sql.repl.eagerEval.enabled", True) # Property used to format output tables better
spark

In [ ]:
df = spark.read.option("header", True).option("inferSchema", True).csv("/content/custs1.txt")

In [ ]:
df.printSchema()

root
 |-- cid: integer (nullable = true)
 |-- f_name: string (nullable = true)
 |-- l_name: string (nullable = true)
 |-- age: integer (nullable = true)
 |-- desig: string (nullable = true)

In [ ]:
from pyspark.sql.functions import col

In [ ]:
#1.to select the records f_name,l_name,age where age>40
df.select('f_name','l_name','age').where('age> 40').show()

+--------+----------+---+
|  f_name|    l_name|age|
+--------+----------+---+
|Kristina|     Chung| 55|
|   Paige|      Chen| 74|
|Gretchen|      Hill| 66|
|   Karen|   Puckett| 74|
| Patrick|      Song| 42|
|   Elsie|  Hamilton| 43|
|   Hazel|    Bender| 63|
| Dolores|McLaughlin| 60|
| Francis|  McNamara| 47|
|  Marion|      Moon| 41|
|    Beth|   Woodard| 65|
|   Julia|     Desai| 49|
|  Jerome|   Wallace| 52|
|    Neal|  Lawrence| 72|
|    Jean|   Griffin| 45|
|Kristine| Dougherty| 63|
| Crystal|    Powers| 67|
|    Eric|    Steele| 66|
|  Wesley|    Teague| 42|
|  Claire| Gallagher| 42|
+--------+----------+---+
only showing top 20 rows

In [ ]:
#2.to get records which f_name starts with s
df.where(col("f_name").startswith("S")).show()

+-------+---------+-------+---+--------------------+
|    cid|   f_name| l_name|age|               desig|
+-------+---------+-------+---+--------------------+
|4000003|   Sherri| Melton| 34|         Firefighter|
|4000012|    Sandy| Raynor| 26|              Writer|
|4000030|Stephanie|Hawkins| 50|Human resources a...|
|4000035|  Shelley|  Weeks| 25|            Reporter|
|4000052|  Shirley|Merritt| 21|            Reporter|
|4000058|    Scott|  Hoyle| 40|              Doctor|
|4000077| Samantha| Hardin| 27|              Doctor|
|4000078|     Sara|  Lucas| 44|        Loan officer|
|4000079|    Stacy|  Eason| 31|            Musician|
|4000087|    Steve| Graves| 73|               Nurse|
|4000089|   Sherri| Sutton| 75|       Social worker|
|4000092|    Stacy|  Olsen| 25|        Veterinarian|
|4000101|    Scott| Golden| 27|             Teacher|
|4000108|    Shawn| Boykin| 34|        Photographer|
|4000120|     Sara|Perkins| 67|               Actor|
|4000133| Samantha|  Floyd| 72|    Childcare worker|
|4000140|   Sidney|   Lane| 54|        Statistician|
|4000142|   Sandra| Heller| 51|        Photographer|
|4000171|  Stephen|  Finch| 30|               Coach|
|4000184|    Sarah|    Fox| 73|        Psychologist|
+-------+---------+-------+---+--------------------+
only showing top 20 rows

In [ ]:
#3.use the like operatore l_name starts with f
df.where(col("l_name").like("F%")).show()

+-------+--------+--------+---+--------------------+
|    cid|  f_name|  l_name|age|               desig|
+-------+--------+--------+---+--------------------+
|4000133|Samantha|   Floyd| 72|    Childcare worker|
|4000135| Vincent| Fischer| 33|        Statistician|
|4000162|   Bruce| Farrell| 35|           Librarian|
|4000171| Stephen|   Finch| 30|               Coach|
|4000184|   Sarah|     Fox| 73|        Psychologist|
|4000265|   Stacy| Frazier| 69|            Designer|
|4000303|    Erin|   Finch| 54|      Police officer|
|4000362|   Holly|     Fox| 74|           Physicist|
|4000379|   Harry|  Foster| 50|               Coach|
|4000444|  Thomas|  Fuller| 51|    Childcare worker|
|4000455| Deborah|  French| 56|          Accountant|
|4000459|Gretchen| Francis| 60|          Politician|
|4000461|  Audrey| Forrest| 50|           Architect|
|4000467|   Derek|Freedman| 66|Recreation and fi...|
|4000514|  Nathan|    Ford| 36|   Financial analyst|
|4000546|  Calvin|Fletcher| 55|               Judge|
|4000585|  Lester|   Finch| 65|Human resources a...|
|4000608|   Cathy| Freeman| 42|Computer hardware...|
|4000633| Kristen|  Fisher| 59|Recreation and fi...|
|4000646|  Bonnie|Friedman| 57|Computer hardware...|
+-------+--------+--------+---+--------------------+
only showing top 20 rows

In [ ]:
#get all records where design in ('Laywer','Pilot','Teacher')
df.where(col('desig').isin('Lawyer','Teacher','Pilot')).show()

+-------+---------+---------+---+-------+
|    cid|   f_name|   l_name|age|  desig|
+-------+---------+---------+---+-------+
|4000001| Kristina|    Chung| 55|  Pilot|
|4000002|    Paige|     Chen| 74|Teacher|
|4000005|    Karen|  Puckett| 74| Lawyer|
|4000007|    Elsie| Hamilton| 43|  Pilot|
|4000026|   Marian|  Solomon| 27| Lawyer|
|4000033|      Tim|    Watts| 58| Lawyer|
|4000063|  Melinda|  Proctor| 27|Teacher|
|4000101|    Scott|   Golden| 27|Teacher|
|4000109|  Vincent|   Sumner| 31| Lawyer|
|4000130|     Toni|    Glass| 46| Lawyer|
|4000167|     Lynn|Robertson| 45| Lawyer|
|4000195|   Claire|  Pickett| 59| Lawyer|
|4000229|     Faye|   Norman| 64|  Pilot|
|4000230|    Kathy|    Burch| 28|  Pilot|
|4000251|   Jeremy|    House| 61|  Pilot|
|4000271|    Alice|    Nance| 59|  Pilot|
|4000322|Geraldine|   Jensen| 50|  Pilot|
|4000336|   Steven|  Ballard| 62|  Pilot|
|4000346|    Diana|    Crane| 26| Lawyer|
|4000352|   Ernest|  Stanton| 51| Lawyer|
+-------+---------+---------+---+-------+
only showing top 20 rows

In [ ]:
#find the result where age >40 and the desig is pilot
#both conditions need to be in bracket
df.where((col('age') > 50) & (col('desig')=="Pilot")).show()

+-------+----------+--------+---+-----+
|    cid|    f_name|  l_name|age|desig|
+-------+----------+--------+---+-----+
|4000001|  Kristina|   Chung| 55|Pilot|
|4000229|      Faye|  Norman| 64|Pilot|
|4000251|    Jeremy|   House| 61|Pilot|
|4000271|     Alice|   Nance| 59|Pilot|
|4000336|    Steven| Ballard| 62|Pilot|
|4000392|      Emma|   Olson| 74|Pilot|
|4000403|       Leo|Lassiter| 65|Pilot|
|4000423|      Alan|  O'Neal| 59|Pilot|
|4000562|    Jordan|   Wrenn| 61|Pilot|
|4000601|     Allan|  Nguyen| 51|Pilot|
|4000893|      Gene|    Love| 59|Pilot|
|4000912|     Maria|  Reilly| 64|Pilot|
|4000958|     Danny|  Bowers| 72|Pilot|
|4001039|   Dorothy|   Stone| 52|Pilot|
|4001092|Jacqueline|Friedman| 55|Pilot|
|4001250|  Nicholas| Leonard| 55|Pilot|
|4001424|     Jesse|   Eaton| 58|Pilot|
|4001428|   Deborah|   Britt| 64|Pilot|
|4001489|   Gregory|Saunders| 63|Pilot|
|4001494|     Jesse|  Peters| 56|Pilot|
+-------+----------+--------+---+-----+
only showing top 20 rows

In [ ]:
#show the result where age is between 40 and 50
df.where(col("age").between(40,50)).show(truncate=False)

+-------+---------+---------+---+---------------------------+
|cid    |f_name   |l_name   |age|desig                      |
+-------+---------+---------+---+---------------------------+
|4000006|Patrick  |Song     |42 |Veterinarian               |
|4000007|Elsie    |Hamilton |43 |Pilot                      |
|4000011|Francis  |McNamara |47 |Therapist                  |
|4000013|Marion   |Moon     |41 |Carpenter                  |
|4000015|Julia    |Desai    |49 |Musician                   |
|4000018|Jean     |Griffin  |45 |Childcare worker           |
|4000023|Wesley   |Teague   |42 |Carpenter                  |
|4000025|Claire   |Gallagher|42 |Musician                   |
|4000028|Dwight   |Monroe   |45 |Economist                  |
|4000029|Wayne    |Connolly |40 |Real estate agent          |
|4000030|Stephanie|Hawkins  |50 |Human resources assistant  |
|4000042|Katherine|Bender   |44 |Physicist                  |
|4000045|Lois     |Joseph   |44 |Musician                   |
|4000047|Christina|Bowden   |47 |Computer software engineer |
|4000058|Scott    |Hoyle    |40 |Doctor                     |
|4000059|Pat      |Allen    |45 |Secretary                  |
|4000060|Michelle |Rich     |44 |Artist                     |
|4000069|Melanie  |Hewitt   |47 |Real estate agent          |
|4000072|Caroline |O'Brien  |44 |Computer support specialist|
|4000078|Sara     |Lucas    |44 |Loan officer               |
+-------+---------+---------+---+---------------------------+
only showing top 20 rows

In [ ]:
df.where(col("desig").isNull()).show()

+-------+-------+---------+---+-----+
|    cid| f_name|   l_name|age|desig|
+-------+-------+---------+---+-----+
|4000014|   Beth|  Woodard| 65| null|
|4000046|  Louis|Rosenthal| 31| null|
|4000257| Monica|   Dodson| 58| null|
|4000327|Heather|   Dawson| 43| null|
|4000411| Joanna|   Hoover| 50| null|
|4000463|  Wayne|   Weiner| 70| null|
|4000494|Stephen|   Waller| 75| null|
|4000679|Herbert| Jernigan| 59| null|
|4000695|  Chris| Anderson| 52| null|
|4000890| Hannah|    Casey| 30| null|
|4000944|   Mary|  Boyette| 59| null|
|4001066|    Ron|   Brandt| 65| null|
|4001359|  Craig| McNamara| 31| null|
|4001400|Matthew|  Beasley| 39| null|
|4001478| Sheryl|     Lamb| 53| null|
|4001505|Raymond|    Roach| 30| null|
|4001550|  Barry|    Sykes| 34| null|
|4001561| Arlene|     Gray| 51| null|
|4001675| Wesley|   Graves| 33| null|
|4001952|  Renee|      Day| 46| null|
+-------+-------+---------+---+-----+
only showing top 20 rows

In [ ]:
df.where(col("desig").isNull()).count()

83

In [ ]:
txns_df = spark.read.option("header",True).csv("/content/txns_with_header.csv")

In [ ]:
txns_df.show(truncate=False)

+--------+----------+-------+-------+----------------------+---------------------------------+--------------+--------------+------+
|txn_id  |txn_dt    |cid    |amt    |prod_cat              |prod                             |city          |state         |mode  |
+--------+----------+-------+-------+----------------------+---------------------------------+--------------+--------------+------+
|00000000|06-26-2011|4007024|04a0.33|Exercise & Fitness    |Cardio Machine Accessories       |Clarksville   |Tennessee     |credit|
|00000001|05-26-2011|4006742|198.44 |Exercise & Fitness    |Weightlifting Gloves             |Long Beach    |California    |credit|
|00000002|06-01-2011|4009775|005.58 |Exercise & Fitness    |Weightlifting Machine Accessories|Anaheim       |California    |credit|
|00000003|06-05-2011|4002199|198.19 |Gymnastics            |Gymnastics Rings                 |Milwaukee     |Wisconsin     |credit|
|00000004|12-17-2011|4002613|098.81 |Team Sports           |Field Hockey                     |Nashville     |Tennessee     |credit|
|00000005|02-14-2011|4007591|193.63 |Outdoor Recreation    |Camping & Backpacking & Hiking   |Chicago       |Illinois      |credit|
|00000006|10-28-2011|4002190|027.89 |Puzzles               |Jigsaw Puzzles                   |Charleston    |South Carolina|credit|
|00000007|07-14-2011|4002964|096.01 |Outdoor Play Equipment|Sandboxes                        |Columbus      |Ohio          |credit|
|00000008|01-17-2011|4007361|010.44 |Winter Sports         |Snowmobiling                     |Des Moines    |Iowa          |credit|
|00000009|05-17-2011|4004798|152.46 |Jumping               |Bungee Jumping                   |St. Petersburg|Florida       |credit|
|00000010|05-29-2011|4004646|180.28 |Outdoor Recreation    |Archery                          |Reno          |Nevada        |credit|
|00000011|06-18-2011|4008071|121.39 |Outdoor Play Equipment|Swing Sets                       |Columbus      |Ohio          |credit|
|00000012|02-08-2011|4002473|041.52 |Indoor Games          |Bowling                          |San Francisco |California    |credit|
|00000013|03-13-2011|4003268|107.80 |Team Sports           |Field Hockey                     |Honolulu      |Hawaii        |credit|
|00000014|02-25-2011|4004613|036.81 |Gymnastics            |Vaulting Horses                  |Los Angeles   |California    |credit|
|00000015|10-20-2011|4003179|137.64 |Combat Sports         |Fencing                          |Honolulu      |Hawaii        |credit|
|00000016|05-28-2011|4009135|035.56 |Exercise & Fitness    |Free Weight Bars                 |Columbia      |South Carolina|credit|
|00000017|10-18-2011|4006679|075.55 |Water Sports          |Scuba Diving & Snorkeling        |Omaha         |Nebraska      |credit|
|00000018|11-18-2011|4002444|088.65 |Team Sports           |Baseball                         |Salt Lake City|Utah          |credit|
|00000019|08-28-2011|4008871|051.81 |Water Sports          |Life Jackets                     |Newark        |New Jersey    |credit|
+--------+----------+-------+-------+----------------------+---------------------------------+--------------+--------------+------+
only showing top 20 rows

In [100]:
from pyspark.sql.types import StructType,StructField,StringType,IntegerType,DecimalType,DateType,TimestampType

In [ ]:
txns_schema=StructType([StructField("txn_id",IntegerType()),
                       StructField("txn_dt",DateType()),
                       StructField("cid",IntegerType()),
                       StructField("amt",DecimalType(10,3)),
                       StructField("prod_cat",StringType()),
                       StructField("prod",StringType()),
                       StructField("city",StringType()),
                       StructField("state",StringType()),
                       StructField("mode",StringType())           ])

In [ ]:
txns_df = spark.read.option("header",True).schema(txns_schema).option("dateFormat","MM-dd-yyyy").csv("/content/txns_with_header.csv")

In [ ]:
txns_df.printSchema()

root
 |-- txn_id: integer (nullable = true)
 |-- txn_dt: date (nullable = true)
 |-- cid: integer (nullable = true)
 |-- amt: decimal(10,3) (nullable = true)
 |-- prod_cat: string (nullable = true)
 |-- prod: string (nullable = true)
 |-- city: string (nullable = true)
 |-- state: string (nullable = true)
 |-- mode: string (nullable = true)

In [ ]:
txns_df.show(100,truncate=False)

+------+----------+-------+-------+----------------------+---------------------------------+----------------+--------------+------+
|txn_id|txn_dt    |cid    |amt    |prod_cat              |prod                             |city            |state         |mode  |
+------+----------+-------+-------+----------------------+---------------------------------+----------------+--------------+------+
|0     |2011-06-26|4007024|null   |Exercise & Fitness    |Cardio Machine Accessories       |Clarksville     |Tennessee     |credit|
|1     |2011-05-26|4006742|198.440|Exercise & Fitness    |Weightlifting Gloves             |Long Beach      |California    |credit|
|2     |2011-06-01|4009775|5.580  |Exercise & Fitness    |Weightlifting Machine Accessories|Anaheim         |California    |credit|
|3     |2011-06-05|4002199|198.190|Gymnastics            |Gymnastics Rings                 |Milwaukee       |Wisconsin     |credit|
|4     |2011-12-17|4002613|98.810 |Team Sports           |Field Hockey                     |Nashville       |Tennessee     |credit|
|5     |2011-02-14|4007591|193.630|Outdoor Recreation    |Camping & Backpacking & Hiking   |Chicago         |Illinois      |credit|
|6     |2011-10-28|4002190|27.890 |Puzzles               |Jigsaw Puzzles                   |Charleston      |South Carolina|credit|
|7     |2011-07-14|4002964|96.010 |Outdoor Play Equipment|Sandboxes                        |Columbus        |Ohio          |credit|
|8     |2011-01-17|4007361|10.440 |Winter Sports         |Snowmobiling                     |Des Moines      |Iowa          |credit|
|9     |2011-05-17|4004798|152.460|Jumping               |Bungee Jumping                   |St. Petersburg  |Florida       |credit|
|10    |2011-05-29|4004646|180.280|Outdoor Recreation    |Archery                          |Reno            |Nevada        |credit|
|11    |2011-06-18|4008071|121.390|Outdoor Play Equipment|Swing Sets                       |Columbus        |Ohio          |credit|
|12    |2011-02-08|4002473|41.520 |Indoor Games          |Bowling                          |San Francisco   |California    |credit|
|13    |2011-03-13|4003268|107.800|Team Sports           |Field Hockey                     |Honolulu        |Hawaii        |credit|
|14    |2011-02-25|4004613|36.810 |Gymnastics            |Vaulting Horses                  |Los Angeles     |California    |credit|
|15    |2011-10-20|4003179|137.640|Combat Sports         |Fencing                          |Honolulu        |Hawaii        |credit|
|16    |2011-05-28|4009135|35.560 |Exercise & Fitness    |Free Weight Bars                 |Columbia        |South Carolina|credit|
|17    |2011-10-18|4006679|75.550 |Water Sports          |Scuba Diving & Snorkeling        |Omaha           |Nebraska      |credit|
|18    |2011-11-18|4002444|88.650 |Team Sports           |Baseball                         |Salt Lake City  |Utah          |credit|
|19    |2011-08-28|4008871|51.810 |Water Sports          |Life Jackets                     |Newark          |New Jersey    |credit|
|20    |2011-06-29|4001364|41.550 |Exercise & Fitness    |Weightlifting Belts              |New Orleans     |Louisiana     |credit|
|21    |2011-02-14|4003144|45.790 |Air Sports            |Parachutes                       |New York        |New York      |credit|
|22    |2011-10-10|4006131|19.640 |Water Sports          |Kitesurfing                      |Saint Paul      |Minnesota     |credit|
|23    |2011-05-02|4007596|99.500 |Gymnastics            |Gymnastics Rings                 |Springfield     |Illinois      |credit|
|24    |2011-06-10|4009341|151.200|Water Sports          |Surfing                          |Plano           |Texas         |credit|
|25    |2011-10-14|4003760|144.200|Indoor Games          |Darts                            |Phoenix         |Arizona       |credit|
|26    |2011-10-11|4000403|31.580 |Combat Sports         |Wrestling                        |Orange          |California    |credit|
|27    |2011-09-29|4005211|66.400 |Games                 |Mahjong                          |Fremont         |California    |credit|
|28    |2011-05-12|4001864|79.780 |Team Sports           |Cricket                          |Lexington       |Kentucky      |credit|
|29    |2011-06-03|4005691|126.900|Outdoor Recreation    |Hunting                          |Phoenix         |Arizona       |credit|
|30    |2011-03-14|4009693|47.050 |Water Sports          |Swimming                         |Lincoln         |Nebraska      |credit|
|31    |2011-11-28|4002130|5.030  |Games                 |Dice & Dice Sets                 |Los Angeles     |California    |credit|
|32    |2011-01-29|4007790|20.130 |Team Sports           |Soccer                           |Springfield     |Illinois      |credit|
|33    |2011-06-15|4005337|154.150|Outdoor Recreation    |Lawn Games                       |Nashville       |Tennessee     |credit|
|34    |2011-05-06|4000663|98.960 |Team Sports           |Indoor Volleyball                |Atlanta         |Georgia       |credit|
|35    |2011-04-12|4006967|185.260|Games                 |Board Games                      |Centennial      |Colorado      |credit|
|36    |2011-10-13|4009055|35.660 |Team Sports           |Football                         |Saint Paul      |Minnesota     |credit|
|37    |2011-04-19|4005737|20.200 |Outdoor Recreation    |Shooting Games                   |San Diego       |California    |credit|
|38    |2011-08-05|4000175|150.600|Outdoor Recreation    |Camping & Backpacking & Hiking   |Hampton         |Virginia      |credit|
|39    |2011-03-12|4001873|174.360|Outdoor Play Equipment|Swing Sets                       |Pittsburgh      |Pennsylvania  |credit|
|40    |2011-11-07|4006442|165.100|Team Sports           |Cheerleading                     |Reno            |Nevada        |credit|
|41    |2011-04-16|4004237|28.110 |Indoor Games          |Bowling                          |Westminster     |Colorado      |cash  |
|42    |2011-09-10|4007470|38.520 |Outdoor Recreation    |Tetherball                       |Denton          |Texas         |cash  |
|43    |2011-04-22|4002554|32.340 |Water Sports          |Water Polo                       |Las Vegas       |Nevada        |cash  |
|44    |2011-09-11|4001041|135.370|Water Sports          |Surfing                          |Seattle         |Washington    |credit|
|45    |2011-11-27|4005646|90.040 |Exercise & Fitness    |Abdominal Equipment              |Honolulu        |Hawaii        |credit|
|46    |2011-05-27|4005580|52.290 |Gymnastics            |Vaulting Horses                  |Cleveland       |Ohio          |credit|
|47    |2011-10-23|4009698|100.100|Outdoor Play Equipment|Swing Sets                       |Everett         |Washington    |credit|
|48    |2011-09-27|4009252|157.940|Exercise & Fitness    |Exercise Bands                   |Philadelphia    |Pennsylvania  |credit|
|49    |2011-07-12|4003896|144.590|Jumping               |Jumping Stilts                   |Cambridge       |Massachusetts |credit|
|50    |2011-10-20|4005578|55.930 |Jumping               |Pogo Sticks                      |Everett         |Washington    |credit|
|51    |2011-02-17|4002323|32.650 |Water Sports          |Life Jackets                     |Columbus        |Georgia       |cash  |
|52    |2011-02-04|4008289|44.820 |Outdoor Play Equipment|Lawn Water Slides                |Hampton         |Virginia      |cash  |
|53    |2011-06-12|4003091|44.460 |Water Sports          |Scuba Diving & Snorkeling        |Charleston      |South Carolina|cash  |
|54    |2011-10-03|4007357|154.870|Outdoor Recreation    |Running                          |Long Beach      |California    |credit|
|55    |2011-12-16|4004961|106.110|Water Sports          |Swimming                         |New York        |New York      |credit|
|56    |2011-06-21|4008744|176.630|Outdoor Recreation    |Geocaching                       |Boston          |Massachusetts |credit|
|57    |2011-12-20|4007745|178.200|Outdoor Recreation    |Skating                          |San Jose        |California    |credit|
|58    |2011-12-29|4003248|194.860|Water Sports          |Windsurfing                      |Oklahoma City   |Oklahoma      |credit|
|59    |2011-11-07|4002854|21.430 |Winter Sports         |Snowboarding                     |Philadelphia    |Pennsylvania  |cash  |
|60    |2011-04-23|4004874|118.180|Exercise & Fitness    |Cardio Machine Accessories       |Richmond        |Virginia      |credit|
|61    |2011-02-16|4009680|41.140 |Exercise & Fitness    |Weightlifting Machine Accessories|Phoenix         |Arizona       |cash  |
|62    |2011-04-23|4000539|100.930|Team Sports           |Beach Volleyball                 |Columbia        |Missouri      |credit|
|63    |2011-11-25|4009719|129.260|Winter Sports         |Downhill Skiing                  |Orlando         |Florida       |credit|
|64    |2011-09-28|4008455|105.240|Exercise & Fitness    |Weightlifting Machine Accessories|Nashville       |Tennessee     |credit|
|65    |2011-12-12|4005887|66.060 |Outdoor Recreation    |Riding Scooters                  |Jackson         |Mississippi   |credit|
|66    |2011-02-05|4006293|89.140 |Outdoor Recreation    |Tetherball                       |Gresham         |Oregon        |credit|
|67    |2011-10-10|4002526|159.140|Games                 |Poker Chips & Sets               |Las Vegas       |Nevada        |credit|
|68    |2011-05-04|4006736|171.570|Dancing               |Ballet Bars                      |Minneapolis     |Minnesota     |credit|
|69    |2011-05-12|4005403|89.910 |Team Sports           |Softball                         |Denton          |Texas         |credit|
|70    |2011-05-13|4006291|32.280 |Outdoor Recreation    |Skating                          |Salt Lake City  |Utah          |cash  |
|71    |2011-01-26|4009360|152.210|Team Sports           |Cricket                          |Portland        |Oregon        |credit|
|72    |2011-01-04|4001305|150.820|Outdoor Recreation    |Skateboarding                    |Denver          |Colorado      |credit|
|73    |2011-05-20|4008653|133.200|Outdoor Recreation    |Riding Scooters                  |Jackson         |Mississippi   |credit|
|74    |2011-10-27|4002106|148.310|Games                 |Portable Electronic Games        |Pasadena        |California    |credit|
|75    |2011-11-19|4006262|125.280|Combat Sports         |Wrestling                        |Denton          |Texas         |credit|
|76    |2011-07-26|4003860|170.050|Jumping               |Trampolines                      |Charleston      |South Carolina|credit|
|77    |2011-10-07|4000458|74.060 |Puzzles               |Jigsaw Puzzles                   |Jacksonville    |Florida       |credit|
|78    |2011-06-03|4002200|175.240|Team Sports           |Baseball                         |Cleveland       |Ohio          |credit|
|79    |2011-08-04|4005751|39.800 |Gymnastics            |Springboards                     |St. Louis       |Missouri      |cash  |
|80    |2011-10-05|4005625|174.820|Outdoor Recreation    |Ice Climbing                     |Eugene          |Oregon        |credit|
|81    |2011-03-08|4003500|188.900|Water Sports          |Swimming                         |San Jose        |California    |credit|
|82    |2011-01-16|4001098|21.230 |Gymnastics            |Gymnastics Rings                 |Tampa           |Florida       |cash  |
|83    |2011-12-23|4007259|22.420 |Outdoor Recreation    |Rock Climbing                    |Hampton         |Virginia      |cash  |
|84    |2011-05-31|4000293|49.970 |Exercise & Fitness    |Stopwatches                      |Clarksville     |Tennessee     |cash  |
|85    |2011-10-17|4008024|31.840 |Water Sports          |Swimming                         |Saint Paul      |Minnesota     |cash  |
|86    |2011-06-15|4008884|80.990 |Outdoor Recreation    |Tetherball                       |Orange          |California    |credit|
|87    |2011-06-05|4001050|89.560 |Gymnastics            |Gymnastics Mats                  |West Valley City|Utah          |credit|
|88    |2011-07-05|4003309|55.350 |Water Sports          |Towed Water Sports               |Lincoln         |Nebraska      |credit|
|89    |2011-05-18|4001561|184.560|Team Sports           |Cheerleading                     |Plano           |Texas         |credit|
|90    |2011-01-02|4009270|176.340|Air Sports            |Parachutes                       |San Antonio     |Texas         |credit|
|91    |2011-02-28|4002697|35.750 |Outdoor Recreation    |Running                          |Flint           |Michigan      |cash  |
|92    |2011-09-19|4008469|42.510 |Team Sports           |Team Handball                    |Oklahoma City   |Oklahoma      |cash  |
|93    |2011-02-01|4006425|193.110|Winter Sports         |Sledding                         |Irvine          |California    |credit|
|94    |2011-08-03|4005513|68.860 |Jumping               |Jumping Stilts                   |Green Bay       |Wisconsin     |credit|
|95    |2011-07-04|4004611|146.360|Water Sports          |Whitewater Rafting               |Hampton         |Virginia      |credit|
|96    |2011-10-24|4005227|130.520|Exercise & Fitness    |Medicine Balls                   |Las Vegas       |Nevada        |credit|
|97    |2011-10-07|4002299|197.540|Exercise & Fitness    |Exercise Balls                   |Plano           |Texas         |credit|
|98    |2011-09-04|4002707|5.950  |Games                 |Dominoes                         |Lincoln         |Nebraska      |cash  |
|99    |2011-10-10|4006562|37.290 |Outdoor Play Equipment|Lawn Water Slides                |Dallas          |Texas         |cash  |
+------+----------+-------+-------+----------------------+---------------------------------+----------------+--------------+------+
only showing top 100 rows

In [101]:
dt_schema=StructType([StructField("NAME",StringType()),
                       StructField("txn_dt",TimestampType()),
                            ])

In [109]:
date_df = spark.read.option("header",True).schema(dt_schema).option("TimestampFormat","dd/MM/yyyy HH:mm").csv("/content/date_format_3.txt")

In [110]:
date_df.show()

+-----+-------------------+
| NAME|             txn_dt|
+-----+-------------------+
|Ankit|2023-03-18 13:10:00|
+-----+-------------------+